## Q1. List any five functions of the pandas library with execution

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv")

# head . It is used to display first 5 elements
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [3]:
# tail it is used to display last 5 elements
df.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [4]:
# describe it is used to display summary statistics
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [5]:
# info it is used to display summary of the dataframe
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [6]:
# shape it is used to display the dimensions of the dataframe
df.shape

(891, 12)

## Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [7]:
def re_indexing(df) :    
    # re-indexing our dataframe 
    return df.set_index(pd.Series(range(1,2*len(df)+1,2)))

In [8]:
re_indexing( pd.DataFrame( {"A": df["Name"][:10] ,"B" : df["Age"][:10] , "C" : df["Pclass"][:10]} ) )

                                                    A     B  C
1                             Braund, Mr. Owen Harris  22.0  3
3   Cumings, Mrs. John Bradley (Florence Briggs Th...  38.0  1
5                              Heikkinen, Miss. Laina  26.0  3
7        Futrelle, Mrs. Jacques Heath (Lily May Peel)  35.0  1
9                            Allen, Mr. William Henry  35.0  3
11                                   Moran, Mr. James   NaN  3
13                            McCarthy, Mr. Timothy J  54.0  1
15                     Palsson, Master. Gosta Leonard   2.0  3
17  Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)  27.0  3
19                Nasser, Mrs. Nicholas (Adele Achem)  14.0  2

## Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The function should print the sum to the console.

For example, if the 'Values' column of df contains the values [10, 20, 30, 40, 50], your function should 
calculate and print the sum of the first three values, which is 60.

In [9]:
def sum_3_values(df):
    #sum of first three values
    return df["Values"][:3].sum()

In [10]:
sum_3_values( pd.DataFrame( {"A": df["Name"][:10], "Values": df["Fare"][:10]} ) )

86.4583

## Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column 'Word_Count' that contains the number of words in each row of the 'Text' column.

In [11]:
def count_text_column(df):
     #this function count the word in text column and store it in a new column "Word_Count"
    df["Word_Count"] = df["Text"].apply(len)
    return df

In [12]:
count_text_column( pd.DataFrame( {"Text": df["Name"][:10] ,"B" : df["Age"][:10] , "C" : df["Pclass"][:10]} ) )

                                                Text     B  C  Word_Count
0                            Braund, Mr. Owen Harris  22.0  3          23
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  38.0  1          51
2                             Heikkinen, Miss. Laina  26.0  3          22
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  35.0  1          44
4                           Allen, Mr. William Henry  35.0  3          24
5                                   Moran, Mr. James   NaN  3          16
6                            McCarthy, Mr. Timothy J  54.0  1          23
7                     Palsson, Master. Gosta Leonard   2.0  3          30
8  Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)  27.0  3          49
9                Nasser, Mrs. Nicholas (Adele Achem)  14.0  2          35

## Q5. How are DataFrame.size() and DataFrame.shape() different?

.size returns the total number of elements in the DataFrame, which is equal to the product of the number of rows and columns in the DataFrame. In other hand .shape returns a tuple representing the dimensions (number of rows and columns) of the DataFrame.

In [13]:
df.size

10692

In [14]:
df.shape

(891, 12)

## Q6. Which function of pandas do we use to read an excel file?

In [15]:
#.read_excel method is used to read excel file
df5 = pd.read_excel("excel_file.xlsx")

In [16]:
df5

,Data,Length before Cleaning,Cleaned String,Length of Cleaned String
0,‭720‬,5,720.00,3
1,‭1834.06‬,9,1834.06,7
2,‭1063.71‬,9,1063.71,7
3,‭25000‬,7,25000.00,5
4,‭10000‬,7,10000.00,5
5,‭10000‬,7,10000.00,5
6,‭2500‬,6,2500.00,4
7,‭23950‬,7,23950.00,5
8,‭10000‬,7,10000.00,5
9,‭5000‬,6,5000.00,4
10,‭2910‬,6,2910.00,4
11,‭25000‬,7,25000.00,5

## Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email addresses in the format 'username@domain.com'. Write a Python function that creates a new column 'Username' in df that contains only the username part of each email address.

The username is the part of the email address that appears before the '@' symbol. For example, if the 
email address is 'john.doe@example.com', the 'Username' column should contain 'john.doe'. Your 
function should extract the username from each email address and store it in the new 'Username' 
column.

In [17]:
def extract_name(df):
    #this function take dataframe as input and extract name from the email to store it into a new column
    df["Name"] = df["Email"].apply( lambda x : x.split("@")[0] )
    return df

In [18]:
extract_name( pd.DataFrame( {"Email" : ["Braund@gmail.com", "Heikkinen@gmail.com","Allen@yahoo.com"] , "Age" : [33,38,26] } ) )

                 Email  Age       Name
0     Braund@gmail.com   33     Braund
1  Heikkinen@gmail.com   38  Heikkinen
2      Allen@yahoo.com   26      Allen

## Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The function should return a new DataFrame that contains only the selected rows. 
 
For example, if df contains the following values:

A   B   C

0  3   5   1

1  8   2   7

2  6   9   4

3  2   3   5

4  9   1   2

Your function should select the following rows:   A   B   C

1  8   2   7

4  9   1   2

The function should return a new DataFrame that contains only the selected rows.

In [19]:
def filter_col(df):
    # This function filter column A > 5 and column B < 10
    df = df[ (df["A"] > 5) &( df["B"] < 10 ) ]
    return df

In [20]:
filter_col( pd.DataFrame( {"A" : [3,8,6,2,9] , "B" :  [5,2,9,3,1], "C": [1,7,4,5,2]} ) )

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

## Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean, median, and standard deviation of the values in the 'Values' column.

In [ ]:
def statistics(df) :
    # This function calculate mean , median and standard deviation
    mean = df["Values"].mean()
    median = df["Values"].median()
    std = df["Values"].std()
    
    return f"mean : {mean} ,median: {median} , standard deviation: {std}"

In [ ]:
statistics( pd.DataFrame( {"Values" : df["Age"][:10] } ) )

## Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days for each row in the DataFrame. The moving average should be calculated using a window of size 7 and  should include the current day.

In [ ]:
import datetime
import random

In [ ]:
#let's create our dataframe
today = datetime.datetime.now().date()

df10 = pd.DataFrame({ "Sales" : [ random.randint(0,100) for i in range(20) ] , "Date": pd.date_range(end=today, periods = 20) })
df10 = df10.sort_values("Date", ascending = False).reset_index(drop = True)
df10

In [ ]:
def average_7_days(df):
    #this function calculate moving average of last 7 days and store it into a new column MovingAverage
    df["MovingAverage"] = df["Sales"].rolling(window=7 , min_periods=1).mean()
    return df

In [ ]:
df1 = pd.DataFrame({ "Sales" : [ random.randint(0,100) for i in range(20) ] , "Date": pd.date_range(end=today, periods = 20) })
df1 = df1.sort_values("Date", ascending = False).reset_index(drop = True)
average_7_days( df1 )

## Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g. Monday, Tuesday) corresponding to each date in the 'Date' column. 
 
For example, if df contains the following values:

Date

0  2023-01-01

1  2023-01-02

2  2023-01-03

3  2023-01-04

4  2023-01-05

Your function should create the following DataFrame:


Date               Weekday

0  2023-01-01     Sunday

1  2023-01-02     Monday

2  2023-01-03    Tuesday

3  2023-01-04    Wednesday

4  2023-01-05    Thursday

The function should return the modified DataFrame.

In [ ]:
def add_weekday( df ):
    # This function add weekday column to the dataframe
    
    #convert to datetime object
    df["Date"] = pd.to_datetime( df["Date"] )
    
    #add weekday column
    df["Weekday"] = df["Date"].dt.day_name()
    
    return df

In [ ]:
add_weekday( pd.DataFrame( { "Date":pd.date_range(start ="01-01-2023", end="01-10-2023") } ) )

## Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python function to select all rows where the date is between '2023-01-01' and '2023-01-31'.

In [ ]:
def return_dates( df, start, end ):
    # return date needed
    df["Date"] = pd.to_datetime( df["Date"] )
    
    return df[df["Date"].between(start,end)]

In [ ]:
return_dates( pd.DataFrame({"Date" : pd.date_range( start="01-01-2023", end = "06-01-2023" )}) , "2023-01-01", "2023-01-31")

## Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to be imported?

To use the basic functions of pandas, the first and foremost necessary library that needs to be imported is pandas itself. You can import pandas using the following line of code:

In [ ]:
import pandas as pd